number = input("הכנס מספר בעל 7 ספרות: ")

if len(number) != 7 or not number.isdigit():
    print("המספר שהוזן אינו תקין. יש להזין מספר בעל 7 ספרות.")
else:
    # א. הסיפרה הראשונה שווה לאחרונה
    if number[0] == number[-1]:
        print("הסיפרה הראשונה שווה לאחרונה.")
    else:
        print("הסיפרה הראשונה אינה שווה לאחרונה.")
    
    # ב. הסיפרה השניה לא שווה לסיפרה השישית
    if number[1] != number[5]:
        print("הסיפרה השניה אינה שווה לסיפרה השישית.")
    else:
        print("הסיפרה השניה שווה לסיפרה השישית.")
    
    # ג. הסיפרה השלישית שווה לסיפרה הרביעית וגם שונה מהחמישית
    if number[2] == number[3] and number[2] != number[4]:
        print("הסיפרה השלישית שווה לסיפרה הרביעית וגם שונה מהחמישית.")
    else:
        print("הסיפרה השלישית אינה שווה לסיפרה הרביעית או שהיא שווה לחמישית.")